src/main/java/ru/vk/itmo/test/timofeevkirill/results/task5/wrk2/put/sync_4
./wrk -d 2m -t 8 -c 64 -R 14000 -s /home/aphirri/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/timofeevkirill/scripts/lua/put.lua -L http://localhost:8080/v0/entry
Running 2m test @ http://localhost:8080/v0/entry
  8 threads and 64 connections
  Thread calibration: mean lat.: 7.079ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 7.111ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 7.206ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 7.088ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 7.192ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 7.149ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 7.199ms, rate sampling interval: 26ms
  Thread calibration: mean lat.: 7.291ms, rate sampling interval: 26ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.14ms    4.68ms  42.75ms   83.26%
    Req/Sec     1.79k   147.07     2.44k    76.24%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.98ms
 75.000%    7.85ms
 90.000%   11.22ms
 99.000%   26.77ms
 99.900%   37.12ms
 99.990%   40.26ms
 99.999%   41.76ms
100.000%   42.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.067     0.000000            1         1.00
       1.929     0.100000       154033         1.11
       2.753     0.200000       308285         1.25
       3.493     0.300000       462249         1.43
       4.219     0.400000       615873         1.67
       4.983     0.500000       770402         2.00
       5.399     0.550000       846887         2.22
       5.879     0.600000       924184         2.50
       6.439     0.650000      1000829         2.86
       7.087     0.700000      1077877         3.33
       7.847     0.750000      1154688         4.00
       8.287     0.775000      1193354         4.44
       8.759     0.800000      1231873         5.00
       9.279     0.825000      1270196         5.71
       9.847     0.850000      1308934         6.67
      10.471     0.875000      1347452         8.00
      10.823     0.887500      1366593         8.89
      11.223     0.900000      1385746        10.00
      11.703     0.912500      1404934        11.43
      12.287     0.925000      1424136        13.33
      13.031     0.937500      1443529        16.00
      13.471     0.943750      1453049        17.78
      13.975     0.950000      1462602        20.00
      14.559     0.956250      1472209        22.86
      15.271     0.962500      1481845        26.67
      16.327     0.968750      1491501        32.00
      17.087     0.971875      1496297        35.56
      18.015     0.975000      1501135        40.00
      19.103     0.978125      1505913        45.71
      20.383     0.981250      1510705        53.33
      22.287     0.984375      1515524        64.00
      23.567     0.985938      1517925        71.11
      25.103     0.987500      1520325        80.00
      26.223     0.989062      1522724        91.43
      27.119     0.990625      1525168       106.67
      28.063     0.992188      1527537       128.00
      28.671     0.992969      1528740       142.22
      29.375     0.993750      1529952       160.00
      30.255     0.994531      1531152       182.86
      31.231     0.995313      1532350       213.33
      32.399     0.996094      1533552       256.00
      33.055     0.996484      1534158       284.44
      33.727     0.996875      1534757       320.00
      34.367     0.997266      1535362       365.71
      35.007     0.997656      1535969       426.67
      35.551     0.998047      1536580       512.00
      35.839     0.998242      1536875       568.89
      36.159     0.998437      1537179       640.00
      36.415     0.998633      1537473       731.43
      36.767     0.998828      1537765       853.33
      37.183     0.999023      1538071      1024.00
      37.407     0.999121      1538222      1137.78
      37.631     0.999219      1538366      1280.00
      37.919     0.999316      1538513      1462.86
      38.239     0.999414      1538672      1706.67
      38.527     0.999512      1538817      2048.00
      38.687     0.999561      1538886      2275.56
      38.879     0.999609      1538964      2560.00
      39.071     0.999658      1539039      2925.71
      39.295     0.999707      1539118      3413.33
      39.487     0.999756      1539192      4096.00
      39.583     0.999780      1539225      4551.11
      39.711     0.999805      1539268      5120.00
      39.807     0.999829      1539300      5851.43
      39.967     0.999854      1539346      6826.67
      40.095     0.999878      1539378      8192.00
      40.191     0.999890      1539398      9102.22
      40.287     0.999902      1539415     10240.00
      40.383     0.999915      1539435     11702.86
      40.479     0.999927      1539453     13653.33
      40.607     0.999939      1539472     16384.00
      40.671     0.999945      1539478     18204.44
      40.767     0.999951      1539493     20480.00
      40.831     0.999957      1539498     23405.71
      40.959     0.999963      1539508     27306.67
      41.055     0.999969      1539516     32768.00
      41.119     0.999973      1539523     36408.89
      41.151     0.999976      1539526     40960.00
      41.247     0.999979      1539531     46811.43
      41.311     0.999982      1539536     54613.33
      41.407     0.999985      1539539     65536.00
      41.535     0.999986      1539541     72817.78
      41.567     0.999988      1539544     81920.00
      41.695     0.999989      1539546     93622.86
      41.791     0.999991      1539548    109226.67
      41.951     0.999992      1539551    131072.00
      41.983     0.999993      1539552    145635.56
      42.015     0.999994      1539553    163840.00
      42.047     0.999995      1539555    187245.71
      42.047     0.999995      1539555    218453.33
      42.207     0.999996      1539557    262144.00
      42.207     0.999997      1539557    291271.11
      42.271     0.999997      1539558    327680.00
      42.271     0.999997      1539558    374491.43
      42.463     0.999998      1539559    436906.67
      42.655     0.999998      1539560    524288.00
      42.655     0.999998      1539560    582542.22
      42.655     0.999998      1539560    655360.00
      42.655     0.999999      1539560    748982.86
      42.687     0.999999      1539561    873813.33
      42.687     0.999999      1539561   1048576.00
      42.687     0.999999      1539561   1165084.44
      42.687     0.999999      1539561   1310720.00
      42.687     0.999999      1539561   1497965.71
      42.783     0.999999      1539562   1747626.67
      42.783     1.000000      1539562          inf
#[Mean    =        6.137, StdDeviation   =        4.678]
#[Max     =       42.752, Total count    =      1539562]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1679729 requests in 2.00m, 94.51MB read
Requests/sec:  13997.79
Transfer/sec:    806.51KB